In [1]:
# inline magic command
%matplotlib inline

In [2]:
# dependencies and setup
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
# files to loaad
city_data_to_load="resources/city_data.csv"
ride_data_to_load="resources/ride_data.csv"

In [4]:
# read city data file and store in DataFrame
city_data_df=pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [5]:
# read the ride data file and store in dataframe
ride_data_df=pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city             date   fare        ride_id
0  Lake Jonathanshire  1/14/2019 10:14  13.83  5739410935873
1  South Michelleport   3/4/2019 18:24  30.24  2343912425577
2  Port Samanthamouth   2/24/2019 4:29  33.44  2005065760003
3          Rodneyfort  2/10/2019 23:22  23.44  5149245426178
4          South Jack    3/6/2019 4:28  34.58  3908451377344
5        South Latoya  3/11/2019 12:26   9.52  1994999424437
6       New Paulville  2/27/2019 11:17  43.25   793208410091
7        Simpsonburgh   4/26/2019 0:43  35.98   111953927754
8     South Karenland    1/8/2019 3:28  35.09  7995623208694
9       North Jasmine    3/9/2019 6:26  42.81  5327642267789

In [6]:
# get the columns and rows that are notnull
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [7]:
# get the columns and rows that are notnull
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
# get data types of each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
# get unique values of city type
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
# get the num of data points from the urban cities
sum(city_data_df["type"]=="Urban")

66

In [11]:
# get the num of data points from the rural cities
sum(city_data_df["type"]=="Rural")

18

In [12]:
# get the num of data points from the suburban cities
sum(city_data_df["type"]=="Suburban")

36

In [13]:
# columns and rows notnull from ride data
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [14]:
# get columns and rows that are notnull
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [15]:
# get the dtypes for each column ride data
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [16]:
# combine data into single dataset
pyber_data_df=pd.merge(ride_data_df,city_data_df,
                       how="left",
                       on=["city","city"]
                      )
# display the dataframe
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

In [17]:
# create urban city dataframe
urban_cities_df=pyber_data_df[pyber_data_df["type"]=="Urban"]
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

In [18]:
# create suburban cities df
suburban_cities_df=pyber_data_df[pyber_data_df["type"]=="Suburban"]
suburban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,1/27/2019 3:08,27.79,6653622887913,11,Suburban
1626,East Kentstad,4/7/2019 19:44,18.75,6575961095852,20,Suburban
1627,Lake Omar,1/17/2019 21:33,21.71,966911700371,22,Suburban
1628,Myersshire,2/27/2019 17:38,17.10,5706770909868,19,Suburban
1629,West Hannah,4/19/2019 1:06,37.78,2273047151891,12,Suburban

In [19]:
# create rural cities df
rural_cities_df=pyber_data_df[pyber_data_df["type"]=="Rural"]
rural_cities_df.head()

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,4/13/2019 11:13,43.22,1076079536213,9,Rural
2251,North Holly,2/2/2019 14:54,12.42,1985256326182,8,Rural
2252,Michaelberg,3/27/2019 18:27,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2/23/2019 21:12,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,5/6/2019 8:57,51.80,4018025271936,2,Rural